In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [3]:
print(exam_data)

{'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [4]:
print(type(exam_data))

<class 'dict'>

In [5]:
print(exam_data['name'])

['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas']

In [6]:
print(exam_data[1])

KeyError: 1

In [7]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [8]:
print(labels)

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [9]:
print(type(labels))

<class 'list'>

In [10]:
print(labels[0])

a

In [11]:
df = pd.DataFrame(exam_data , index=labels)

In [12]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [13]:
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [14]:
d1 = {'Name': ['Pankaj', 'Meghna', 'David', 'Lisa'], 'ID': [1, 2, 3, 4], 'Salary': [100, 200, np.nan, pd.NaT],
      'Role': ['CEO', None, pd.NaT, pd.NaT]}

In [15]:
df = pd.DataFrame(d1)

In [16]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [17]:
df.head(2)

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None

In [18]:
df.tail(2)

    Name  ID Salary Role
2  David   3    NaN  NaT
3   Lisa   4    NaT  NaT

In [19]:
df.isnull().sum()

Name      0
ID        0
Salary    2
Role      3
dtype: int64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   ID      4 non-null      int64
 2   Salary  2 non-null      object
 3   Role    1 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [21]:
df1 = df.dropna()

In [22]:
df1

     Name  ID Salary Role
0  Pankaj   1    100  CEO

In [23]:
df2 = df.dropna(axis=1)
print(df2)

     Name  ID
0  Pankaj   1
1  Meghna   2
2   David   3
3    Lisa   4

In [24]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    NaN   NaT
3    Lisa   4    NaT   NaT

In [25]:
df['Salary'].fillna('300',inplace=True)

In [26]:
df

     Name  ID Salary  Role
0  Pankaj   1    100   CEO
1  Meghna   2    200  None
2   David   3    300   NaT
3    Lisa   4    300   NaT

In [27]:
df['Role'].fillna('CEO',inplace=True)

In [28]:
df

     Name  ID Salary Role
0  Pankaj   1    100  CEO
1  Meghna   2    200  CEO
2   David   3    300  CEO
3    Lisa   4    300  CEO